id: 55fb2630-fc2f-4d6b-ab7e-ce79dece4ea7
name: Awake Security - High Severity Events
description: |
  'Triggers an incident for every HostName if High Severity Events are found'
severity: Medium
requiredDataConnectors:
  - connectorId: AristaAwakeSecurity
    dataTypes:
      - AwakeSecurity
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
query: |
  CommonSecurityLog 
  | where DeviceVendor == "Arista Networks" and DeviceProduct == "Awake Security"
  | summarize Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP), 
    DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(toint(LogSeverity)) by SourceHostName
  | where MaxSeverity > 6; 
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: SourceHostName
version: 1.0.0
