id: e2b714cc-9f1b-4e98-b9a7-56f68f9cdc90
name: Awake Security - Multiple Destinations Events
description: |
  'Triggers an incident for every HostName if Models Matches for more than one Destination are found'
severity: Medium
requiredDataConnectors:
  - connectorId: AristaAwakeSecurity
    dataTypes:
      - AwakeSecurity
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
query: |
  union CommonSecurityLog
  | where DeviceVendor == "Arista Networks" and DeviceProduct == "Awake Security"
  | summarize Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP), 
    DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(toint(LogSeverity)) by SourceHostName
  | where array_length(DestinationIPs) > 1 
entityMappings:
    fieldMappings:
      - identifier: HostName
        columnName: SourceHostName
version: 1.0.0
