id: f470f1b3-3fe6-4173-9e0c-ad77684c2cb2
name: Awake Security - High Match Events
description: |
  'Triggers an incident for every HostName if High Adversariel Model Matches Events are found'
severity: Medium
requiredDataConnectors:
  - connectorId: AristaAwakeSecurity
    dataTypes:
      - AwakeSecurity
queryFrequency: 1h
queryPeriod: 1h
triggerOperator: gt
triggerThreshold: 0
query: |
  union CommonSecurityLog
  | where DeviceVendor == "Arista Networks" and DeviceProduct == "Awake Security"
  | summarize Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP), 
    DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(toint(LogSeverity)) by SourceHostName
  | where array_length(DestinationIPs) > 1
entityMappings:
  - entityType: Host
    fieldMappings:
      - identifier: HostName
        columnName: SourceHostName
version: 1.0.0
