$schema: https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#
contentVersion: 1.0.0.0
parameters:
  workspace:
    type: String
resources:
  - id: '[concat(resourceId(''Microsoft.OperationalInsights/workspaces/providers'', parameters(''workspace''), ''Microsoft.SecurityInsights''),''/alertRules/2cbc265a-dd13-4e18-ab0f-ec1963badc9c'')]'
    name: '[concat(parameters(''workspace''),''/Microsoft.SecurityInsights/2cbc265a-dd13-4e18-ab0f-ec1963badc9c'')]'
    type: Microsoft.OperationalInsights/workspaces/providers/alertRules
    kind: Scheduled
    apiVersion: 2021-03-01-preview
    properties:
      displayName: Awake Security - High Severity Matches By Device
      description: Create an incident for every device with high severity event(s).
      severity: Medium
      enabled: true
      query: "CommonSecurityLog \n| where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\" and toint(LogSeverity) > 6\n| summarize Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP), DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(todecimal  (LogSeverity)) by SourceHostName\n"
      queryFrequency: PT1H
      queryPeriod: PT1H
      triggerOperator: GreaterThan
      triggerThreshold: 0
      suppressionDuration: PT5H
      suppressionEnabled: false
      tactics: []
      alertRuleTemplateName: null
      incidentConfiguration:
        createIncident: true
        groupingConfiguration:
          enabled: true
          reopenClosedIncident: false
          lookbackDuration: P3D
          matchingMethod: Selected
          groupByEntities:
            - Host
          groupByAlertDetails: []
          groupByCustomDetails:
            - Device
      eventGroupingSettings:
        aggregationKind: AlertPerResult
      alertDetailsOverride:
        alertDisplayNameFormat: Awake Security - High Severity Matches On Device {{SourceHostName}}
        alertDescriptionFormat: |-
          Device {{SourceHostName}} matched the following high-severity Awake model(s):

          {{Models}}

          The destination IPs associated with these matches were:

          {{DestinationIPs}}
        alertTacticsColumnName: null
        alertSeverityColumnName: MaxSeverity
      customDetails:
        Matched_Models: Models
        Matches_ASP_URL: ASPMatchURLs
        Device: SourceHostName
        Matches_Count: ModelMatchCount
        Matches_Max_Severity: MaxSeverity
        Matches_Dest_IPs: DestinationIPs
      entityMappings:
        - entityType: Host
          fieldMappings:
            - identifier: HostName
              columnName: SourceHostName
        - entityType: IP
          fieldMappings:
            - identifier: Address
              columnName: SourceIPs
