$schema: https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#
contentVersion: 1.0.0.0
parameters:
  workspace:
    type: String
resources:
  - id: '[concat(resourceId(''Microsoft.OperationalInsights/workspaces/providers'', parameters(''workspace''), ''Microsoft.SecurityInsights''),''/alertRules/f01bdf69-6ba1-406b-8503-453f51522c84'')]'
    name: '[concat(parameters(''workspace''),''/Microsoft.SecurityInsights/f01bdf69-6ba1-406b-8503-453f51522c84'')]'
    type: Microsoft.OperationalInsights/workspaces/providers/alertRules
    kind: Scheduled
    apiVersion: 2021-03-01-preview
    properties:
      displayName: Awake Security - High Match Counts By Device
      description: Create an incident for every device with unexpectedly large number of activity match.
      severity: Medium
      enabled: true
      query: "CommonSecurityLog \n| where DeviceVendor == \"Arista Networks\" and DeviceProduct == \"Awake Security\"\n| summarize Models=make_set(Activity), ASPMatchURLs=make_set(DeviceCustomString2), SourceIPs=make_set(SourceIP), DestinationIPs=make_set(DestinationIP), ModelMatchCount=sum(EventCount), MaxSeverity=max(todecimal  (LogSeverity)) by SourceHostName\n| where ModelMatchCount > 1000 and MaxSeverity > 2\n| extend SeverityName=iff(MaxSeverity == 0, \"Informational\", iff(MaxSeverity < 5, \"Low\", iff(MaxSeverity < 8, \"Medium\", \"High\")));\n"
      queryFrequency: PT1H
      queryPeriod: PT1H
      triggerOperator: GreaterThan
      triggerThreshold: 0
      suppressionDuration: PT5H
      suppressionEnabled: false
      tactics: []
      alertRuleTemplateName: null
      incidentConfiguration:
        createIncident: true
        groupingConfiguration:
          enabled: true
          reopenClosedIncident: false
          lookbackDuration: P3D
          matchingMethod: Selected
          groupByEntities:
            - Host
          groupByAlertDetails: []
          groupByCustomDetails:
            - Device
      eventGroupingSettings:
        aggregationKind: AlertPerResult
      alertDetailsOverride:
        alertDisplayNameFormat: Awake Security - High Model Match Counts On Device {{SourceHostName}}
        alertDescriptionFormat: |-
          The following Awake model(s):

          {{Models}}

          matched {{ModelMatchCount}} activities, an unexpectedly large number. The destination IPs associated with these matches were:

          {{DestinationIPs}}
        alertTacticsColumnName: null
        alertSeverityColumnName: SeverityName
      customDetails:
        Matched_Models: Models
        Matches_ASP_URLs: ASPMatchURLs
        Device: SourceHostName
        Matches_Count: ModelMatchCount
        Matches_Max_Severity: MaxSeverity
        Matches_Dest_IPs: DestinationIPs
      entityMappings:
        - entityType: Host
          fieldMappings:
            - identifier: HostName
              columnName: SourceHostName
        - entityType: IP
          fieldMappings:
            - identifier: Address
              columnName: SourceIPs
